import type { GeoZone } from '@/types'

export const mockGeoZones: GeoZone[] = [
  {
    id: '1',
    name: 'Москва центр',
    coordinates: [
      [37.611347, 55.757135],
      [37.611847, 55.751435],
      [37.617941, 55.751035],
      [37.618941, 55.757135],
      [37.611347, 55.757135],
    ],
    visible: false,
    color: 'rgba(33, 150, 243, 0.25)',
    borderColor: 'rgba(33, 150, 243, 0.8)',
    createdAt: '2023-04-15 10:00:00',
  },
  {
    id: '2',
    name: 'Аэропорт Шереметьево',
    coordinates: [
      [37.405696, 55.978531],
      [37.385696, 55.968531],
      [37.415696, 55.958531],
      [37.435696, 55.968531],
      [37.405696, 55.978531],
    ],
    visible: false,
    color: 'rgba(76, 175, 80, 0.25)',
    borderColor: 'rgba(76, 175, 80, 0.8)',
    createdAt: '2023-04-15 11:00:00',
  },
  {
    id: '3',
    name: 'Белград',
    coordinates: [
      [20.3675, 44.8436],
      [20.639, 44.8176],
      [20.6667, 44.75],
      [20.5147, 44.6939],
      [20.2667, 44.8],
      [20.3675, 44.8436],
    ],
    visible: false,
    color: 'rgba(156, 39, 176, 0.25)',
    borderColor: 'rgba(156, 39, 176, 0.8)',
    createdAt: '2023-04-15 12:30:00',
  },
]
